Revit 2027 API
FabricSheet.SetSegmentLength Method
 Sets the value of the bent fabric sheet segment(like A, B, C, D etc.)
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSegmentLength(
	ElementId segmentParameterId,
	double value
)
Public Sub SetSegmentLength (
	segmentParameterId As ElementId,
	value As Double
)
public:
void SetSegmentLength(
	ElementId^ segmentParameterId,
	double value
)
member SetSegmentLength :
        segmentParameterId : ElementId *
        value : float -> unit
Parameters
segmentParameterId ElementId
 The segment ID of the bent fabric sheet.
value Double
 The length value to set
Exceptions
Exception | Condition
ArgumentException |  The given value for value is not a number -or-
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The given value for value must be between 0 and 30000 feet.
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace